app/Http/Controllers/CategoryController.php

                ->make(true);
        }

        $parentCategories = Category::whereNull('parent_id')->where('status', 'active')->orderBy('name')->get();
---
select * from `categories` where `parent_id` is null and `status` = 'active' order by `name` asc