app/Http/Controllers/RoleController.php

                ->make(true);
        }

        $permission = Permission::orderBy('name', 'asc')->get();
---
select * from `permissions` order by `name` asc