app/Http/Controllers/UserController.php

    public function create(): View
    {
        $roles = Role::pluck('name', 'name')->all();
---
select `name` from `roles`

    public function edit(User $user): View
    {
        $roles = Role::pluck('name', 'name')->all();
---
select `name` from `roles`

        $input = Arr::except($input, ['confirm-password', 'roles', '_token', '_method']);
        $user->update($input);

        DB::table('model_has_roles')->where('model_id', $user->id)->delete();
---
delete from `model_has_roles` where `model_id` = 1

    public function destroy(User $user): RedirectResponse
    {
        if ($user->image && $user->image !== 'default-user.jpg') {
            $oldFilePath = public_path('storage/uploads/users/' . $user->image);
            if (File::exists($oldFilePath)) {
                File::delete($oldFilePath);
            }
        }

        $user->delete();
---
delete from `users` where `id` = 15