app/Http/Controllers/Dashboard/DashboardController.php

select count(*) as aggregate from `users`
select count(*) as aggregate from `roles`
select count(*) as aggregate from `permissions`
select count(*) as aggregate from `products`
select count(*) as aggregate from `categories` where `parent_id` is null
select count(*) as aggregate from `categories` where `parent_id` is not null
select count(*) as aggregate from `suppliers`
select * from `orders` order by `created_at` desc limit 5
select * from `payments` where `payments`.`order_id` in (89, 90, 91, 92, 93)
select * from `users` where `users`.`id` in (2)
select `products`.`id`, `products`.`name`, `products`.`image`, SUM(order_items.qty) as total_qty, SUM(order_items.subtotal) as total_revenue from `order_items` inner join `orders` on `order_items`.`order_id` = `orders`.`id` inner join `products` on `order_items`.`product_id` = `products`.`id` where `orders`.`status` = 'completed' and `orders`.`created_at` between '2026-05-01 00:00:00' and '2026-05-31 23:59:59' group by `products`.`id`, `products`.`name`, `products`.`image` order by `total_qty` desc limit 5
select `users`.`id`, `users`.`name`, `users`.`image`, COUNT(orders.id) as total_transactions, SUM(orders.total_amount) as total_revenue from `orders` inner join `users` on `orders`.`user_id` = `users`.`id` where `orders`.`status` = 'completed' and `orders`.`created_at` between '2026-05-01 00:00:00' and '2026-05-31 23:59:59' group by `users`.`id`, `users`.`name`, `users`.`image` order by `total_transactions` desc limit 5
select * from `purchases` order by `created_at` desc limit 5
select * from `suppliers` where `suppliers`.`id` in (1, 4, 9)
select * from `categories` where `categories`.`id` in (2)
select * from `products` where `status` = 'active' and `stock` <= 10 order by `stock` asc limit 8
select `suppliers`.`id`, `suppliers`.`name`, COUNT(purchases.id) as total_purchases, SUM(purchases.total_amount) as total_value from `purchases` inner join `suppliers` on `purchases`.`supplier_id` = `suppliers`.`id` where `purchases`.`status` = 'received' and `purchases`.`purchase_date` between '2026-05-01' and '2026-05-31' group by `suppliers`.`id`, `suppliers`.`name` order by `total_purchases` desc limit 5
select DATE(created_at) as date, COUNT(id) as total_orders, SUM(total_amount) as total_revenue from `orders` where `status` = 'completed' and `created_at` >= '2026-04-19 00:00:00' group by DATE(created_at) order by `date` asc
---
    public function index()
    {
        $now = Carbon::now();
        $startOfMonth = $now->copy()->startOfMonth();
        $endOfMonth = $now->copy()->endOfMonth();

        $totalUsers = User::count();
        $totalRoles = Role::count();
        $totalPermissions = Permission::count();

        $totalProducts = Product::count();
        $totalSpecies = Category::whereNull('parent_id')->count();
        $totalCategories = Category::whereNotNull('parent_id')->count();
        $totalSuppliers = Supplier::count();

        $latestOrders = Order::with(['user', 'payment'])
            ->latest()
            ->take(5)
            ->get();

        $topProducts = DB::table('order_items')
            ->join('orders', 'order_items.order_id', '=', 'orders.id')
            ->join('products', 'order_items.product_id', '=', 'products.id')
            ->where('orders.status', 'completed')
            ->whereBetween('orders.created_at', [$startOfMonth, $endOfMonth])
            ->select('products.id', 'products.name', 'products.image', DB::raw('SUM(order_items.qty) as total_qty'), DB::raw('SUM(order_items.subtotal) as total_revenue'))
            ->groupBy('products.id', 'products.name', 'products.image')
            ->orderByDesc('total_qty')
            ->take(5)
            ->get();

        $topKasirs = DB::table('orders')
            ->join('users', 'orders.user_id', '=', 'users.id')
            ->where('orders.status', 'completed')
            ->whereBetween('orders.created_at', [$startOfMonth, $endOfMonth])
            ->select('users.id', 'users.name', 'users.image', DB::raw('COUNT(orders.id) as total_transactions'), DB::raw('SUM(orders.total_amount) as total_revenue'))
            ->groupBy('users.id', 'users.name', 'users.image')
            ->orderByDesc('total_transactions')
            ->take(5)
            ->get();

        $latestPurchases = Purchase::with('supplier')->latest()->take(5)->get();

        $lowStockProducts = Product::with('category')->where('status', 'active')->where('stock', '<=', 10)->orderBy('stock')->take(8)->get();

        $topSuppliers = DB::table('purchases')
            ->join('suppliers', 'purchases.supplier_id', '=', 'suppliers.id')
            ->where('purchases.status', 'received')
            ->whereBetween('purchases.purchase_date', [$startOfMonth->toDateString(), $endOfMonth->toDateString()])
            ->select('suppliers.id', 'suppliers.name', DB::raw('COUNT(purchases.id) as total_purchases'), DB::raw('SUM(purchases.total_amount) as total_value'))
            ->groupBy('suppliers.id', 'suppliers.name')
            ->orderByDesc('total_purchases')
            ->take(5)
            ->get();

        $salesTrend = DB::table('orders')
            ->where('status', 'completed')
            ->where('created_at', '>=', now()->subDays(29)->startOfDay())
            ->select(DB::raw('DATE(created_at) as date'), DB::raw('COUNT(id) as total_orders'), DB::raw('SUM(total_amount) as total_revenue'))
            ->groupBy(DB::raw('DATE(created_at)'))
            ->orderBy('date')
            ->get();

select `status`, COUNT(id) as total from `orders` group by `status`
select `suppliers`.`name`, SUM(purchases.total_amount) as total_value from `purchases` inner join `suppliers` on `purchases`.`supplier_id` = `suppliers`.`id` where `purchases`.`status` = 'received' group by `suppliers`.`name` order by `total_value` desc limit 6
select `parent`.`name` as `category_name`, SUM(products.stock) as total_stock from `products` inner join `categories` on `products`.`category_id` = `categories`.`id` inner join `categories` as `parent` on `categories`.`parent_id` = `parent`.`id` where `products`.`status` = 'active' group by `parent`.`name` order by `total_stock` desc
---
            $salesChartRevenue[] = $found ? (float) $found->total_revenue : 0;
        }

        $orderStatusData = DB::table('orders')->select('status', DB::raw('COUNT(id) as total'))->groupBy('status')->pluck('total', 'status');

        $purchaseBySupplier = DB::table('purchases')->join('suppliers', 'purchases.supplier_id', '=', 'suppliers.id')->where('purchases.status', 'received')->select('suppliers.name', DB::raw('SUM(purchases.total_amount) as total_value'))->groupBy('suppliers.name')->orderByDesc('total_value')->take(6)->get();

        $stockByCategory = DB::table('products')->join('categories', 'products.category_id', '=', 'categories.id')->join('categories as parent', 'categories.parent_id', '=', 'parent.id')->where('products.status', 'active')->select('parent.name as category_name', DB::raw('SUM(products.stock) as total_stock'))->groupBy('parent.name')->orderByDesc('total_stock')->get();